package vika.app.healthy_lifestyle.recommend

class MealPlanManager {
    private val mealPlans: List<MealPlan> = listOf(
        MealPlan(
            1, 0, 20, 30, 30, 40, 30, 50,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода")
        ),
        MealPlan(
            1, 1, 25, 35, 30, 40, 30, 45,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода")
        ),
        MealPlan(
            1, 2, 20, 30, 30, 40, 30, 50,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода")
        ),
        MealPlan(
            1, 3, 15, 25, 20, 30, 50, 60,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода")
        ),
        MealPlan(
            2, 0, 15, 25, 25, 35, 40, 60,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода")
        ),
        MealPlan(
            2, 1, 20, 30, 25, 35, 40, 50,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода")
        ),
        MealPlan(
            2, 2, 15, 25, 25, 35, 40, 60,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода")
        ),
        MealPlan(
            2, 3, 10, 20, 15, 25, 60, 70,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода")
        ),
        MealPlan(
            3, 0, 25, 35, 15, 25, 40, 50,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода")
        ),
        MealPlan(
            3, 1, 25, 35, 15, 25, 40, 50,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода")
        ),
        MealPlan(
            3, 2, 20, 30, 15, 25, 40, 50,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода")
        ),
        MealPlan(
            3, 3, 10, 20, 10, 20, 60, 70,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода")
        )
    )

    fun getMealPlan(target: Int?, meal: Int?): MealPlan? {
        return mealPlans.find { it.target == target && it.meal == meal }
    }
}
