package vika.app.healthy_lifestyle.recommend

class MealPlanManager {
    private val mealPlans: List<MealPlan> = listOf(
        MealPlan(
            1, 0, 20, 30, 30, 40, 30, 50,
            25, 30,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода", "Напиток")
        ),
        MealPlan(
            1, 1, 25, 35, 30, 40, 30, 45,
            30, 35,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода", "Напиток")
        ),
        MealPlan(
            1, 2, 20, 30, 30, 40, 30, 50,
            25, 30,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода", "Напиток")
        ),
        MealPlan(
            1, 3, 15, 25, 20, 30, 50, 60,
            10, 15,
            listOf("Фрукт", "Сладость", "Яйцо", "Мясо", "Дичь", "Субпродукт",
                "Масло", "Орех", "Сыр", "Овощ", "Крупа", "Вода", "Напиток")
        ),
        MealPlan(
            2, 0, 15, 25, 25, 35, 40, 60,
            20, 25,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода", "Напиток")
        ),
        MealPlan(
            2, 1, 20, 30, 25, 35, 40, 50,
            30, 35,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода", "Напиток")
        ),
        MealPlan(
            2, 2, 15, 25, 25, 35, 40, 60,
            25, 30,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода", "Напиток")
        ),
        MealPlan(
            2, 3, 10, 20, 15, 25, 60, 70,
            15, 20,
            listOf("Вода", "Зелень", "Яйцо", "Бобы", "Рыба", "Ягоды",
                "Грибы", "Орех", "Приправа", "Овощ", "Уксус", "Фрукт", "Вода", "Напиток")
        ),
        MealPlan(
            3, 0, 25, 35, 15, 25, 40, 50,
            25, 30,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода", "Напиток")
        ),
        MealPlan(
            3, 1, 25, 35, 15, 25, 40, 50,
            35, 40,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода", "Напиток")
        ),
        MealPlan(
            3, 2, 20, 30, 15, 25, 40, 50,
            20, 25,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода", "Напиток")
        ),
        MealPlan(
            3, 3, 10, 20, 10, 20, 60, 70,
            5, 10,
            listOf("Зелень", "Яйцо", "Ягоды", "Грибы", "Дичь", "Овощ", "Вода", "Напиток")
        )
    )

    private val sportPlan: List<SportPlan> = listOf(
        SportPlan(
            2,
            listOf("Бег", "Виды спорта", "Ходьба", "Езда на велосипеде")
        ),
        SportPlan(
            1,
            listOf("Кондицирующие упражнения", "Ходьба", "Езда на велосипеде")
        ),
        SportPlan(
            0,
            listOf("Виды спорта", "Кондицирующие упражнения")
        )
    )

    fun getMealPlan(target: Int?, meal: Int?): MealPlan? {
        return mealPlans.find { it.target == target && it.meal == meal }
    }

    fun getSportPlan(target: Int): SportPlan?{
        return sportPlan.find{it.target == target}
    }
}
